## Fungsi Text di SQL

Disini kita akan mempelajari fungsi dalam text yang mana dapat dituliskan sebagai berikut:

![image.png](https://drive.google.com/uc?export=view&id=1h1mBYzcxV6gsJYaV9XNcaQTpzN6k-Y6M)

Selanjutnya, kita akan mempelajari bagaimana menggunakan CONCAT (Penggabungan dua kolom jadi satu), seperti berikut ini:

```sql
SELECT CONCAT(column_name1, column_name2)
FROM table_name;
```

In [ ]:
sql(
"""
SELECT contact_name, CONCAT(address, city) full_address
FROM customers LIMIT 5
"""
)

         contact_name                              full_address
0        Maria Anders                       Obere Str. 57Berlin
1        Ana Trujillo  Avda. de la Constitución 2222México D.F.
2      Antonio Moreno                Mataderos  2312México D.F.
3        Thomas Hardy                     120 Hanover Sq.London
4  Christina Berglund                      Berguvsvägen  8Luleå

Selanjutnya, kita akan mempelajari bagaimana menggunakan SUBSTRING_INDEX (pemisahan tertentu), seperti berikut ini:

```sql
SELECT SUBSTRING_INDEX(column, delimiter, index to return)
FROM table_name;
```

Ketentuan
1. column --> merupakan nama kolom yang akan dipecah text-nya, 
2. delimiter --> karakter atau gabungan beberapa karakter untuk pemecah text pada kolom bersangkutan, 
3. index_to_return --> indeks dari pecahan text yang akan diambil.

Contoh:
```sql
SELECT SUBSTRING_INDEX("www.genpep.com", ".", 1);
```

Selanjutnya, kita akan mempelajari bagaimana menggunakan SUBSTR (pengambilan tertentu), seperti berikut ini:

```sql
SELECT SUBSTR(columnName, Start Index, Number of string to be extract)
FROM table_name;
```

Ketentuan
1. columnName --> nama kolom yang akan dicari substring-nya 
2. Start Index --> indeks dari text yang dimiliki (dimulai dari 1) 
3. Number of string to be extract --> jumlah karakter atau beberapa karakter yang akan diambil.

In [ ]:
sql(
"""
SELECT contact_name, SUBSTR(contact_name, 1, 3) call_name
FROM customers LIMIT 5
"""
)

         contact_name call_name
0        Maria Anders       Mar
1        Ana Trujillo       Ana
2      Antonio Moreno       Ant
3        Thomas Hardy       Tho
4  Christina Berglund       Chr

Selanjutnya, kita akan mempelajari bagaimana menggunakan LENGTH (menghitung), seperti berikut ini:

```sql
SELECT LENGTH(columnName)
FROM table_name;
```

In [ ]:
sql(
"""
SELECT contact_name, SUBSTR(contact_name, 1, 3) call_name, LENGTH(contact_name)
FROM customers LIMIT 5
"""
)

         contact_name call_name  length
0        Maria Anders       Mar      12
1        Ana Trujillo       Ana      12
2      Antonio Moreno       Ant      14
3        Thomas Hardy       Tho      12
4  Christina Berglund       Chr      18

Selanjutnya, kita akan mempelajari bagaimana menggunakan REPLACE (mengganti), seperti berikut ini:

```sql
SELECT REPLACE(ColumnName, Character/String to be change, New String/Character)
FROM table_name;
```

Catatan:
1. ColumnName --> nama kolom yang akan diganti isi tiap record/barisnya berdasarkan string/karakter tertentu 
2. Character/String to be change --> string/karakter yang dimiliki untuk diganti 
3. New String/Character --> string/karakter baru pengganti string/karakter sebelumnya

In [ ]:
sql(
"""
SELECT contact_name, REPLACE(contact_name, 'Anders', 'Tru')
FROM customers LIMIT 5
"""
)

         contact_name             replace
0        Maria Anders           Maria Tru
1        Ana Trujillo        Ana Trujillo
2      Antonio Moreno      Antonio Moreno
3        Thomas Hardy        Thomas Hardy
4  Christina Berglund  Christina Berglund

Selanjutnya, kita akan mempelajari bagaimana menggunakan UPPER/LOWER (), seperti berikut ini:

```sql
SELECT UPPER(ColumnName), LOWER(ColumnName)
FROM table_name;
```

In [ ]:
sql(
"""
SELECT contact_name, UPPER(contact_name), LOWER(contact_name)
FROM customers LIMIT 5
"""
)

         contact_name               upper               lower
0        Maria Anders        MARIA ANDERS        maria anders
1        Ana Trujillo        ANA TRUJILLO        ana trujillo
2      Antonio Moreno      ANTONIO MORENO      antonio moreno
3        Thomas Hardy        THOMAS HARDY        thomas hardy
4  Christina Berglund  CHRISTINA BERGLUND  christina berglund